{
  "projects": [
    {
      "title": "Event Management for College Clubs - Sigma Events",
      "description": "Created an event management platform for college clubs, streamlining event organization and attendance management with distinct admin and user interfaces.",
      "achievements": [
        "Implemented user and admin authentication with Google Login/Signup.",
        "Selected for open-source contributions in SWOC Season 4, with active developer involvement."
      ],
      "features": [
        {
          "featureTitle": "Dark mode",
          "featureDescription": "Allows users to switch between light and dark mode as per their comfort."
        },
        {
          "featureTitle": "Personal info stored in MongoDB",
          "featureDescription": "Stores user's personal information in MongoDB so you don't need to fill same details for every event registration."
        },
        {
          "featureTitle": "Easy registration experience",
          "featureDescription": "Allows users to register and manage events easily and seamlessly."
        }
      ],
      "link": "https://sigmaevents.netlify.app/"
    },
    {
      "title": "Quiz Website for Institutes - Quizzer",
      "description": "Built a full-stack web application for quiz management, incorporating multi-role authentication, real-time malpractice detection, and secure Google login.",
      "features": [
        {
          "featureTitle": "Multi-role authentication",
          "featureDescription": "Supports different user roles (admin, teacher, student) with customized access levels."
        },
        {
          "featureTitle": "Real-time malpractice detection",
          "featureDescription": "Monitors quiz sessions to detect and prevent cheating in real-time."
        },
        {
          "featureTitle": "Google Login",
          "featureDescription": "Secure Google authentication integrated for easy access and account management."
        }
      ],
      "link": "https://github.com/abhideepkumar/dbms_quiz"
    },
    {
      "title": "Deepfake Detection Platform - Deep Verify",
      "description": "Developed a website for deepfake detection using HuggingFace's API, addressing ethical concerns in digital media.",
      "features": [
        {
          "featureTitle": "Deepfake detection",
          "featureDescription": "Identifies and flags deepfake content using advanced AI techniques."
        },
        {
          "featureTitle": "Integration with HuggingFace's API",
          "featureDescription": "Utilized HuggingFace's API for efficient deepfake analysis and detection."
        }
      ],
      "link": "https://deepverify0.netlify.app/"
    }
  ],
  "experiences": [
    {
      "role": "Full Stack Developer",
      "company": "Pratigya Team - Google Solution Challenge",
      "duration": "January 2024 - February 2024",
      "link": "https://pratigya-nie.netlify.app/",
      "responsibilities": [
        "Developed a responsive website addressing women's safety, featuring SOS calls, real-time incident updates, and a community feed.",
        "Used the MERN stack with Firebase Firestore for secure data management and Firebase Authentication for user access."
      ]
    },
    {
      "role": "Frontend Developer",
      "company": "Notefy, Google Developer Student Club",
      "duration": "December 2023 - January 2024",
      "link": "",
      "responsibilities": [
        "Led a team of 4 developers to build a website enhancing student learning by summarizing PDFs using OCR recognition and AI models.",
        "Designed and implemented a user-friendly UI/UX using Next.js and Tailwind CSS."
      ]
    }
  ],
  "achievements": [
    {
      "title": "Google Developer Student Club, NIE Mysore",
      "description": ["Tech Core Member, contributed to numerous projects and events, and mentored 150+ students during the RootAccess Hackathon."]
    },
    {
      "title": "Girl Geek IEEE Hackathon, VVCE Mysore",
      "description": [
        "Secured third place with an innovative website integrating Hugging Face's AI for deepfake detection."
      ]
    },
    {
      "title": "Social Winter of Code 2024",
      "description": [
        "My project, Sigma Events, was selected for open-source contributions, with developers actively contributing to the repository."
      ]
    }
  ]
}
